; domain
(define (domain test)

    ;remove requirements that are not needed
    (:requirements :equality :disjunctive-preconditions :negative-preconditions :typing :conditional-effects
    )

    (:types
        vehicle position - object
        car truck motorcycle - vehicle
    )

    (:predicates
        (at ?v - vehicle ?p - position)
        (occupied ?p - position)
        (vertical ?p1 - position ?p2 - position)
        (horizontal ?p1 - position ?p2 - position)
    )

    ; Motorcycle = 1 position
    ; Parameters:
    ; - ?m : the motorcycle to be moved
    ; - ?p : the current position of the motorcycle
    ; - ?pDest : the position where the motorcycle will be moved
    ;
    ; Precondition
    ; - The motorcycle has to be in ?p
    ; - The position ?pDest should be free (not occupied)
    ;
    ; Effect
    ; - If there is an vertical connection between ?p and ?pDest, then the motorcycle will move vertically. 
    ; - The motorcycle will be at ?pDest, which results to be occupied, and will not be art ?p, which will be not occupied.
    (:action move-motorcycle-ver
        :parameters (?m - motorcycle ?p - position ?pDest - position)
        :precondition (and
            (at ?m ?p)
            (not (occupied ?pDest))
            (or (vertical ?p ?pDest) (vertical ?pDest ?p))
        )
        :effect (and

                
                    (at ?m ?pDest)
                    (occupied ?pDest)
                    (not (at ?m ?p))
                    (not (occupied ?p))
                
            
        )
    )
    ; Motorcycle = 1 position
    ; Parameters:
    ; - ?m : the motorcycle to be moved
    ; - ?p : the current position of the motorcycle
    ; - ?pDest : the position where the motorcycle will be moved
    ;
    ; Precondition
    ; - The motorcycle has to be in ?p
    ; - The position ?pDest should be free (not occupied)
    ;
    ; Effect
    ; - If there is an horizontal connection between ?p and ?pDest, then the motorcycle will move horizontally. 
    ; - The motorcycle will be at ?pDest, which results to be occupied, and will not be art ?p, which will be not occupied.
    (:action move-motorcycle-hor
        :parameters (?m - motorcycle ?p - position ?pDest - position)
        :precondition (and
            (at ?m ?p)
            (not (occupied ?pDest))
            (or (horizontal ?p ?pDest) (horizontal ?pDest ?p))

        )
        :effect (and

            (at ?m ?pDest)
            (occupied ?pDest)
            (not (at ?m ?p))
            (not (occupied ?p))

        )
    )

    ; Car = 2 positions
    ; Parameters:
    ; - ?c : the car to be moved
    ; - ?p1 ?p2 : the current position of the car
    ; - ?pDest : the position where the car will be moved
    ;
    ; Precondition
    ; - The car has to be in ?p1 and ?p2
    ; - ?p1 and ?p2 should be different
    ; - The position ?pDest should be free (not occupied)
    ;
    ; Effect
    ; - If there is an vertical connection between ?p and ?p2, then the car will move vertically. 
    ; - If there is an vertical connection between ?p1 and ?pDest, then the car will be at ?pDest and ?p1 and will not be at ?p2 anymore.
    ; - If there is an vertical connection between ?p2 and ?pDest, then the car will be at ?pDest and ?p2 and will not be at ?p1 anymore.

    (:action move-car-ver
        :parameters (?c - car ?p1 - position ?p2 - position ?pDest - position)
        :precondition (and
            (at ?c ?p1)
            (at ?c ?p2)
            (not (occupied ?pDest))
            (not (= ?p1 ?p2))
            (or (vertical ?p1 ?p2) (vertical ?p2 ?p1))
            (or (vertical ?p1 ?pDest) (vertical ?pDest ?p1) (vertical ?p2 ?pDest) (vertical ?pDest ?p2))

        )
        :effect (and

            (when
                (and
                    (or (vertical ?p1 ?pDest) (vertical ?pDest ?p1))
                )
                (and
                    (at ?c ?pDest)
                    (at ?c ?p1)
                    (occupied ?pDest)
                    (not (at ?c ?p2))
                    (not (occupied ?p2))
                )
            )

            (when
                (and
                    (or (vertical ?p2 ?pDest) (vertical ?pDest ?p2))
                )
                (and
                    (at ?c ?pDest)
                    (at ?c ?p2)
                    (occupied ?pDest)
                    (not (at ?c ?p1))
                    (not (occupied ?p1))
                )
            )

        )
    )
    ; Car = 2 positions
    ; Parameters:
    ; - ?c : the car to be moved
    ; - ?p1 ?p2 : the current position of the car
    ; - ?pDest : the position where the car will be moved
    ;
    ; Precondition
    ; - The car has to be in ?p1 and ?p2
    ; - ?p1 and ?p2 should be different
    ; - The position ?pDest should be free (not occupied)
    ;
    ; Effect
    ; - If there is an horizontal connection between ?p1 and ?p2, then the car will move horizontally. 
    ; - If there is an horizontal connection between ?p1 and ?pDest, then the car will be at ?pDest and ?p1 and will not be at ?p2 anymore.
    ; - If there is an horizontal connection between ?p2 and ?pDest, then the car will be at ?pDest and ?p2 and will not be at ?p1 anymore.

    (:action move-car-hor
        :parameters (?c - car ?p1 - position ?p2 - position ?pDest - position)
        :precondition (and
            (at ?c ?p1)
            (at ?c ?p2)
            (not (occupied ?pDest))
            (not (= ?p1 ?p2))
            (or (horizontal ?p1 ?p2) (horizontal ?p2 ?p1))
            (or (horizontal ?p1 ?pDest) (horizontal ?pDest ?p1) (horizontal ?p2 ?pDest) (horizontal ?pDest ?p2))

        )
        :effect (and
            (when
                
                    (or (horizontal ?p1 ?pDest) (horizontal ?pDest ?p1))
                
                (and
                    (at ?c ?pDest)
                    (at ?c ?p1)
                    (occupied ?pDest)
                    (not (at ?c ?p2))
                    (not (occupied ?p2))
                )
            )

            (when

                    (or (horizontal ?p2 ?pDest) (horizontal ?pDest ?p2))
                
                (and
                    (at ?c ?pDest)
                    (at ?c ?p2)
                    (occupied ?pDest)
                    (not (at ?c ?p1))
                    (not (occupied ?p1))
                )
            )

        )
    )

    ; Truck = 3 positions
    ; Parameters:
    ; - ?t : the truck to be moved
    ; - ?p1 ?p2 ?p3: the current positions of the truck
    ; - ?pDest : the position where the truck will be moved
    ;
    ; Precondition
    ; - The truck has to be in ?p1, ?p2 and ?p3
    ; - ?p1, ?p2 and ?p3 should be different
    ; - The position ?pDest should be free (not occupied)
    ;
    ; Effect
    ; - If there is an vertical connection between ?p and ?p2 and between ?p2 and ?p3, then the truck will move vertically. 
    ; - If there is an vertical connection between ?p1 and ?pDest, then the truck will be at ?pDest, ?p1 and ?p2 and will not be at ?p3 anymore.
    ; - If there is an vertical connection between ?p3 and ?pDest, then the truck will be at ?pDest, ?p3 and ?p2 and will not be at ?p1 anymore.

    (:action move-truck-ver
        :parameters (?t - truck ?p1 - position ?p2 - position ?p3 - position ?pDest - position)
        :precondition (and
            (at ?t ?p1)
            (at ?t ?p2)
            (at ?t ?p3)
            (not (occupied ?pDest))
            (not (= ?p1 ?p2))
            (not (= ?p2 ?p3))
            (not (= ?p1 ?p3))

            (or (vertical ?p1 ?p2) (vertical ?p2 ?p1))
            (or (vertical ?p2 ?p3) (vertical ?p3 ?p2))
            (or (vertical ?p1 ?pDest) (vertical ?pDest ?p1) (vertical ?p3 ?pDest) (vertical ?pDest ?p3))

        )
        :effect (and

            (when
          
                    (or (vertical ?p1 ?pDest) (vertical ?pDest ?p1))
                
                (and
                    (at ?t ?pDest)
                    (at ?t ?p1)
                    (at ?t ?p2)
                    (occupied ?pDest)
                    (not (at ?t ?p3))
                    (not (occupied ?p3))
                )
            )

            (when
               
                    (or (vertical ?p3 ?pDest) (vertical ?pDest ?p3))
                
                (and
                    (at ?t ?pDest)
                    (at ?t ?p3)
                    (at ?t ?p2)
                    (occupied ?pDest)
                    (not (at ?t ?p1))
                    (not (occupied ?p1))
                )
            )

        )
    )
    ; Truck = 3 positions
    ; Parameters:
    ; - ?t : the truck to be moved
    ; - ?p1 ?p2 ?p3: the current positions of the truck
    ; - ?pDest : the position where the truck will be moved
    ;
    ; Precondition
    ; - The truck has to be in ?p1, ?p2 and ?p3
    ; - ?p1, ?p2 and ?p3 should be different
    ; - The position ?pDest should be free (not occupied)
    ;
    ; Effect
    ; - If there is an horizontal connection between ?p1 and ?p2 and between ?p2 and ?p3, then the truck will move horizontally. 
    ; - If there is an horizontal connection between ?p1 and ?pDest, then the truck will be at ?pDest, ?p1 and ?p2 and will not be at ?p3 anymore.
    ; - If there is an horizontal connection between ?p3 and ?pDest, then the truck will be at ?pDest, ?p3 and ?p2 and will not be at ?p1 anymore.

    (:action move-truck
        :parameters (?t - truck ?p1 - position ?p2 - position ?p3 - position ?pDest - position)
        :precondition (and
            (at ?t ?p1)
            (at ?t ?p2)
            (at ?t ?p3)
            (not (occupied ?pDest))
            (not (= ?p1 ?p2))
            (not (= ?p2 ?p3))
            (not (= ?p1 ?p3))
            (or (horizontal ?p1 ?p2) (horizontal ?p2 ?p1))
            (or (horizontal ?p2 ?p3) (horizontal ?p3 ?p2))
            (or (horizontal ?p1 ?pDest) (horizontal ?pDest ?p1) (horizontal ?p3 ?pDest) (horizontal ?pDest ?p3))
        )
        :effect (and
            (when
         
                    (or (horizontal ?p1 ?pDest) (horizontal ?pDest ?p1))
                
                (and
                    (at ?t ?pDest)
                    (at ?t ?p1)
                    (at ?t ?p2)
                    (occupied ?pDest)
                    (not (at ?t ?p3))
                    (not (occupied ?p3))
                )
            )

            (when
             
                    (or (horizontal ?p3 ?pDest) (horizontal ?pDest ?p3))
                
                (and
                    (at ?t ?pDest)
                    (at ?t ?p3)
                    (at ?t ?p2)
                    (occupied ?pDest)
                    (not (at ?t ?p1))
                    (not (occupied ?p1))
                )
            )
        )
    )

)

; problem
(define (problem problem_name) (:domain test)

; |1:    |2:     |3:      |4:  c   |5:        |
; |6: t  |7: r   |8:   1  |9:  1   |10:  m1 X |
; |11:   |12:    |13:  c  |14:  c  |15:  2    |
; |16:   |17:    |18:  3  |19:     |20:       |
; |21:   |22:    |23:     |24:     |25:       |


(:objects 
    m1 - motorcycle
    c1 c2 c3 - car
    t1 - truck
    p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 p11 p12 p13 p14 p15 p16 p17 p18 p19 p20 p21 p22 p23 p24 p25 - position
)

(:init
    (horizontal p1 p2)(horizontal p2 p3)(horizontal p3 p4)(horizontal p4 p5)
    (horizontal p6 p7)(horizontal p7 p8)(horizontal p8 p9)(horizontal p9 p10)
    (horizontal p11 p12)(horizontal p12 p13)(horizontal p13 p14)(horizontal p14 p15)
    (horizontal p16 p17)(horizontal p17 p18)(horizontal p18 p19)(horizontal p19 p20)
    (horizontal p21 p22)(horizontal p22 p23)(horizontal p23 p24)(horizontal p24 p25)

    (vertical p1 p6)(vertical p2 p7)(vertical p3 p8)(vertical p4 p9)(vertical p5 p10)
    (vertical p6 p11)(vertical p7 p12)(vertical p8 p13)(vertical p9 p14)(vertical p10 p15)
    (vertical p11 p16)(vertical p12 p17)(vertical p13 p18)(vertical p14 p19)(vertical p15 p20)
    (vertical p16 p21)(vertical p17 p22)(vertical p18 p23)(vertical p19 p24)(vertical p20 p25)
        
    (at t1 p6)
    (at t1 p7)
    (at t1 p8)

    (at c1 p4)
    (at c1 p9)

    (at c2 p14)
    (at c2 p15)

    (at c3 p13)
    (at c3 p18)

    (at m1 p10)

    (occupied p6)
    (occupied p7)
    (occupied p8)
    (occupied p4)
    (occupied p9)
    (occupied p14)
    (occupied p15)
    (occupied p13)
    (occupied p18)
    (occupied p10)
)

(:goal (and
    (at t1 p10)
))


)

; plan
1. (move-car-ver c3 p18 p13 p23)
   deleted: (at c3 p13) (occupied p13)
   added: (at c3 p23) (occupied p23)
   goals met: 0 of 1
2. (move-car-hor c2 p15 p14 p13)
   deleted: (at c2 p15) (occupied p15)
   added: (at c2 p13) (occupied p13)
   goals met: 0 of 1
3. (move-car-hor c2 p14 p13 p12)
   deleted: (at c2 p14) (occupied p14)
   added: (at c2 p12) (occupied p12)
   goals met: 0 of 1
4. (move-car-ver c1 p9 p4 p14)
   deleted: (at c1 p4) (occupied p4)
   added: (at c1 p14) (occupied p14)
   goals met: 0 of 1
5. (move-car-ver c1 p14 p9 p19)
   deleted: (at c1 p9) (occupied p9)
   added: (at c1 p19) (occupied p19)
   goals met: 0 of 1
6. (move-truck t1 p8 p7 p6 p9)
   deleted: (at t1 p6) (occupied p6)
   added: (at t1 p9) (occupied p9)
   goals met: 0 of 1
7. (move-motorcycle-ver m1 p10 p15)
   deleted: (at m1 p10) (occupied p10)
   added: (at m1 p15) (occupied p15)
   goals met: 0 of 1
8. (move-truck t1 p9 p8 p7 p10)
   deleted: (at t1 p7) (occupied p7)
   added: (at t1 p10) (occupied p10)
   goals met: 1 of 1
